In [19]:
import pandas as pd
import numpy as np

df = pd.DataFrame([
    [np.nan, 2, np.nan, 0],
    [3, 4, np.nan, 1],
    [np.nan, np.nan, np.nan, np.nan],
    [np.nan, 3, np.nan, 4]
], 
columns=list("ABCD"))

df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [28]:
# Dropping columns including missing value
a = df.dropna(axis = 1,how = 'any')
a

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [21]:
a = df.dropna(axis=1,how='all')
a

     A    B    D
0  NaN  2.0  0.0
1  3.0  4.0  1.0
2  NaN  NaN  NaN
3  NaN  3.0  4.0

In [22]:
a = df.dropna(axis=0,how='all')
a

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
3  NaN  3.0 NaN  4.0

In [23]:
# dropping columns including a specific number of missing values
a = df[df.isnull().sum(axis=1) <=2]
a

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
3  NaN  3.0 NaN  4.0

In [24]:
# Number of missing values in each row
a = df.isnull().sum()
a

A    3
B    1
C    4
D    1
dtype: int64

In [25]:
# replacing missing values with basic measures values like mean, median etc.
a = df.fillna(df.mean())
a

     A    B   C         D
0  3.0  2.0 NaN  0.000000
1  3.0  4.0 NaN  1.000000
2  3.0  3.0 NaN  1.666667
3  3.0  3.0 NaN  4.000000

In [26]:
a = df.fillna(df.median())
a

     A    B   C    D
0  3.0  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  3.0  3.0 NaN  1.0
3  3.0  3.0 NaN  4.0

In [27]:
a = df.fillna(df.mode().iloc[0])
a

     A    B   C    D
0  3.0  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  3.0  2.0 NaN  0.0
3  3.0  3.0 NaN  4.0